/*******************************************************************************************************
File name:		27XX_ADC_02.c
Author:			Lian_Jin
Email:			lian_jin@sonix.com.cn
Date：			2011/9/19
Description:	ADC Collected Program
				ADC channel: 			P45					 	
				AD Accuracy：			8  bit  
				Filtering approach ：	Moving average
				Output Register : 		ADC_Result

________________________________________________________________________________________________________
--------------------------------------------------------------------------------------------------------
				EXT_V00       				Data:	2011/9/21

				Compiler Version：			V141
________________________________________________________________________________________________________
--------------------------------------------------------------------------------------------------------

Copyright (C) 2008
Sonix RomConverter - Version 2.00.001
----------------------------------------
EPROM Check Sum   : 24552 [0x5FE8] 
Security Check Sum: 12240 [0x2FD0] 
----------------------------------------
Rom total size : 4092 [0xFFC] words
Rom has  used  : 295 [0x127] words			[composed by: all segments size]
Rom Remains    : 3797 [0xED5] words
---------------------------------------
Ram total size    : 256 [0x100] bytes
RamBank0 has used :  26 [0x1a ] bytes			[composed by: Ram hole + all data segments size]
RamBank0 remains  : 102 [0x66 ] bytes
RamBank1 has used :   0 [0x00 ] bytes			[composed by: Ram hole + all data segments size]
RamBank1 remains  : 128 [0x80 ] bytes
---------------------------------------
【修改记录】:
********************************************************************************************************/
//------------------------------------------------------------------------------------------------------

#include	"user.h"

#define	uint  	unsigned int
#define	uchar  	unsigned char
#define ulong	unsigned long
#define	AL		9

uint	ADC_Result;
ulong	ADC_Buf;
uint	__RAM	ArrayADC[8] = {0};
uint	ptr;


void	InitalADC(void);
void	Premain(void);		
void	ADC_DataAverage(void);		
void	ADC_Scan(void);

//------------------------------------------------------------------------------------------------------

/*******************************************************************************************************
***********************************************主 程 序*************************************************
*******************************************************************************************************/
void	main(void)
{
	InitalADC();
	Premain();
	while(1)
	{
		WDTR = 0x5A;
		ADC_Scan();
		ADC_DataAverage();
	}
}
/*******************************************************************************************************
********************************************中断服务程序************************************************
*******************************************************************************************************/
__interrupt	isr(void)
{
	/***中断服务程序***/
}
/*******************************************************************************************************
ADC 扫描程序：	void	ADC_Scan(void)
程 序  功 能：	采集AD口数据，并存放在ArrayADC[]中
*******************************************************************************************************/
void	ADC_Scan(void)			
{
	FADS = 1;

	while(!FEOC);

	FEOC = 0;
	ArrayADC[ptr] = ADB;
	ptr++;
	
	if(ptr == 8)
	{
		ptr = 0;
	}
}
/*******************************************************************************************************
ADC 滤波程序：	void	ADC_DataAverage(void)			 
程 序  功 能：  采用滑动滤波法，结果放在ADC_Result里		 
*******************************************************************************************************/
void	ADC_DataAverage(void)		
{
	uint	i;
	for(i=0;i<8;i++)
	{
		ADC_Buf += ArrayADC[i];
	}
	i = 0;	
	
	ADC_Result = ADC_Buf>>3;		
	ADC_Buf = 0;	
}		
/*******************************************************************************************************
初始化子程序：	void	InitalSystem(void)
程 序  功 能：	设置AD功能相关寄存器
				Input:P45		AD channel：P45
				8 bit ADC 			
*******************************************************************************************************/
void	InitalADC(void)
{
	P4CON = 0x20;					//Selected AIN5(P4.5) as ADC IO Port
	P4M = 0x00;						//Set P4.5 as input state
	P4UR = 0xDF;					//Prohibited P4.5 pull-up resistor
	FADLEN = 0;						//Set Fcpu/1;8-Bit ADC

	ADM = 0X15;
 
	FADENB = 1;						//Enable ADC
	NOP(100);
}
/*******************************************************************************************************
参数预设程序：	void	Premain(void)
程 序  功 能：	初始化寄存器 		
*******************************************************************************************************/
void	Premain(void)
{												
	/*********/
}